PARAMETERS:
('batch_size', 50)
('noise_dim', 100)
('target_length', 200)
('gamma', 1)
('class_weights', True)
('nb_class', 17)
('gen_learning_rate', 0.0005)
('disc_learning_rate', 0.0005)
('discriminator', <tensorflow.python.keras.engine.sequential.Sequential object at 0x000001E35A2B5048>)
('generator', <tensorflow.python.keras.engine.sequential.Sequential object at 0x000001E35DDB0388>)
('generator_optimizer', <tensorflow.python.training.adam.AdamOptimizer object at 0x000001E35E108C88>)
('discriminator_optimizer', <tensorflow.python.training.adam.AdamOptimizer object at 0x000001E35E1086C8>)
DISCRIMINATOR MODEL: 
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
CONV1 (Conv1D)               (None, 200, 64)           384       
_________________________________________________________________
CONV2 (Conv1D)               (None, 196, 64)           20544     
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 98, 64)            0         
_________________________________________________________________
CONV3 (Conv1D)               (None, 94, 64)            20544     
_________________________________________________________________
CONV4 (Conv1D)               (None, 90, 64)            20544     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 45, 64)            0         
_________________________________________________________________
flatten (Flatten)            (None, 2880)              0         
_________________________________________________________________
DEN1 (Dense)                 (None, 1024)              2950144   
_________________________________________________________________
dense (Dense)                (None, 17)                17425     
=================================================================
Total params: 3,029,585
Trainable params: 3,029,585
Non-trainable params: 0
_________________________________________________________________
GENERATOR MODEL:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1024)              119808    
_________________________________________________________________
dense_2 (Dense)              (None, 6400)              6560000   
_________________________________________________________________
batch_normalization_v1 (Batc (None, 6400)              25600     
_________________________________________________________________
reshape (Reshape)            (None, 50, 128)           0         
_________________________________________________________________
up_sampling1d (UpSampling1D) (None, 100, 128)          0         
_________________________________________________________________
batch_normalization_v1_1 (Ba (None, 100, 128)          512       
_________________________________________________________________
conv1d (Conv1D)              (None, 100, 64)           41024     
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 200, 64)           0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 200, 1)            321       
_________________________________________________________________
flatten_1 (Flatten)          (None, 200)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 200)               40200     
_________________________________________________________________
reshape_1 (Reshape)          (None, 200, 1)            0         
=================================================================
Total params: 6,787,465
Trainable params: 6,774,409
Non-trainable params: 13,056
_________________________________________________________________
